/*
        Написать запрос, который выводит общее число тегов
*/
print('tags count: ', 'расчёт количества тегов');
/*
        Добавляем фильтрацию: считаем только количество фильмов с тегом Adventure
*/
print('Adventure" tags count: ', 'расчёт количества тегов "Adventure"');
/*
        Очень сложный запрос: используем группировку данных посчитать количество вхождений для каждого тега
        и напечатать top-3 самых популярных
*/

printjson(
        db.tags.aggregate([
                {"$group": {
                                "--": "--",
                                "--": "--"
                           }
                },
                {"тут модификатор sort по полю с аггрегацией"},
                {$limit: 3}
        ])['_batch']
);
